//24. Найти кубы чисел от 1 до N

// здесь показано решение только поиска кубов в кратком варианте
/* int N = 4;
int cube = N*N*N;
System.Console.WriteLine(cube); */

//здесь метод поиска куба ЧИСЛА, доработать до корректности
/*  int Cube (int N)
{   
    int cube = 0;
    for (int i = 1; i <= N; i++)
    {
        cube += (N*N*N)*i;
    }
     return cube;
}
System.Console.WriteLine(Cube(2)); */

//25. Найти сумму чисел от 1 до А
/* int n = 3;
int summary = (n *(n+1))/2;
System.Console.WriteLine(summary); */

/* int Sum (int A)
{   
    int summary = 0;
    for (int i = 1; i <= A; i++)
    {
        //summary = summary + i;
        summary += i;
    }
     return summary;
}
System.Console.WriteLine(Sum(3));
 */
//26. Возведите число А в натуральную степень B используя цикл

//27. Определить количество цифр в числе

